//1.Створіть абстрактний клас Plant(Рослина), який містить поля Name (назва
//рослини), HeightCm ( висота у сантиметрах) та IsPerennial (багаторічна чи ні),
//а також і віртуальні методи:
//4 Ст.викладач Косирева Л.А., 2025
// Віртуальний метод Describe() — повертає опис рослини;
// Абстрактний метод CalculateWaterNeed() — повертає кількість води (в
//літрах), яку потребує рослина на тиждень.
//2. Реалізуйте класи-нащадки: Tree(Дерево), Flower(Квітка) і Bush(Кущ). У
//кожному з них:
// реалізуйте метод CalculateWaterNeed() з власною логікою (наприклад,
//дерево потребує більше води при більшій висоті);
// перевизначте Describe() з додатковими деталями (наприклад, "Це листяне
//дерево..." або "Квітка з яскравим цвітом").
//3. В основній програмі:
// Створіть масив об'єктів типу Plant, що містить екземпляри різних рослин.
// У циклі пройдіться по елементам масиву, виведіть на екран їх опис і для
//кожної обчисліть потребу у воді. 

using Lab_4;

public class Program
{
    public static void Main(string[] args)
    {
        Plant[] plants = new Plant[]
        {
            new Tree("Дуб", 500, true, true),
            new Flower("Троянда", 50, false, "червоний", 4),
            new Bush("Барбарис", 150, true, 30)
        };

        foreach (var plant in plants)
        {
            Console.WriteLine(plant.Describe());
            Console.WriteLine($"Потреба у воді: {plant.CalculateWaterNeed()} літрів на тиждень\n");
        }
    }
}